STMicroelectronics/STM32CubeWBA/Projects/NUCLEO-WBA55CG/Applications/BLE/BLE_Power_Central/STM32_WPAN/App/app_ble.c
  UNUSED(ext_data);

  if (data[0] == HCI_EVENT_PKT_TYPE)
  {
    APP_BLE_ResumeFlowProcessCb.Callback = BLE_ResumeFlowProcessCallback;
    if (AMM_Alloc (CFG_AMM_VIRTUAL_APP_BLE,
                   DIVC((sizeof(BleEvtPacketHeader_t) + total_length), sizeof (uint32_t)),
                   (uint32_t **)&phcievt,
                   &APP_BLE_ResumeFlowProcessCb) != AMM_ERROR_OK)
    {
      LOG_INFO_APP("Alloc failed\n");
      status = BLE_STATUS_FAILED;
    }
    else if (phcievt != (BleEvtPacket_t *)0 )
    {
      phcievt->evtserial.type = HCI_EVENT_PKT_TYPE;
      phcievt->evtserial.evt.evtcode = data[1];
      phcievt->evtserial.evt.plen  = data[2];
      MEMCPY( (void*)&phcievt->evtserial.evt.payload, &data[3], data[2]);
      LST_insert_tail(&BleAsynchEventQueue, (tListNode *)phcievt);
      UTIL_SEQ_SetTask(1U << CFG_TASK_HCI_ASYNCH_EVT_ID, CFG_SEQ_PRIO_0);
      status = BLE_STATUS_SUCCESS;
    }
  }
  else if (data[0] == HCI_ACLDATA_PKT_TYPE)
  {
    status = BLE_STATUS_SUCCESS;
  }
  return status;
}

/* USER CODE BEGIN FD_WRAP_FUNCTIONS */
void APP_BLE_Key_Button1_Action(void)
{
  if (bleAppContext.Device_Connection_Status == APP_BLE_CONNECTED_CLIENT)
  {
    if(bleAppContext.SendDataStatus == SENDING_DATA_OFF)
    {
      bleAppContext.SendDataStatus = SENDING_DATA_ON;
      UTIL_TIMER_Stop(&(bleAppContext.TimerSendData_Id));
      UTIL_TIMER_StartWithPeriod( &(bleAppContext.TimerSendData_Id), WRITE_TX_INT_MS);
    }
    else
    {
      bleAppContext.SendDataStatus = SENDING_DATA_OFF;
      UTIL_TIMER_Stop(&(bleAppContext.TimerSendData_Id));
    }
  }
  return;
}

static void APP_Send_Data_timCB(void *arg)
{
  /**
   * The code shall be executed in the background as aci command may be sent
   * The background is the only place where the application can make sure a new aci command
   * is not sent if there is a pending one
   */
  UTIL_SEQ_SetTask(1<<CFG_TASK_POCO_WRITE_CHAR_ID, CFG_SEQ_PRIO_0);

  return;
}

void APP_BLE_Key_Button2_Action(void)
{
  tBleStatus ret = BLE_STATUS_INVALID_PARAMS;

  if (bleAppContext.Device_Connection_Status != APP_BLE_CONNECTED_CLIENT)
  {
    ret = aci_gap_clear_security_db();
    if (ret != BLE_STATUS_SUCCESS)
    {
      LOG_ERROR_APP("==>> aci_gap_clear_security_db - Fail, result: 0x%02X \n", ret);
    }
    else
    {
      LOG_INFO_APP("==>> aci_gap_clear_security_db - Success\n");
    }
  }

  return;
}

void APP_BLE_Key_Button3_Action(void)
{

  if (bleAppContext.Device_Connection_Status != APP_BLE_CONNECTED_CLIENT)
  {
    LOG_INFO_APP("  ** No device connected **\n");
  }
  else
  {
    LOG_INFO_APP("  ** CONNECTION UPDATE **\n");
    if(bleAppContext.ConnectionInterval_Level == CONN_INT_MS(CONN_INTERVAL))
    {
      bleAppContext.ConnectionInterval_Level = CONN_INT_MS(CONN_INTERVAL_LP);
    }
    else
    {
      bleAppContext.ConnectionInterval_Level = CONN_INT_MS(CONN_INTERVAL);
    }

    aci_gap_start_connection_update(bleAppContext.connectionHandle,
                                    bleAppContext.ConnectionInterval_Level,
                                    bleAppContext.ConnectionInterval_Level,
                                    0, 0x3e8, 0x0000, 0x0280);

  }
  BleStackCB_Process();
  return;
}

void Check_Button(void)
{
  uint8_t B1,B2,B3;
    if(PWR_CO_GPIO_Status == PWR_CO_GPIO_OFF)
  {
    return;
  }
  else
  {
   if (PWR_CO_GPIO_Status != PWR_CO_GPIO_OFF)
  {
    MX_GPIO_Init();
  }

    B1 = HAL_GPIO_ReadPin(B1_GPIO_Port,B1_Pin);
    B2 = HAL_GPIO_ReadPin(B2_GPIO_Port,B2_Pin);
    B3 = HAL_GPIO_ReadPin(B3_GPIO_Port,B3_Pin);

  if ((B1 != 1)&&(bleAppContext.B1_Switch == 1))
  {
    UTIL_SEQ_SetTask(1U << CFG_TASK_BUTTON_1, CFG_SEQ_PRIO_0);
    bleAppContext.B1_Switch = 0;
    PWR_CO_GPIO_Status = PWR_CO_GPIO_TIM_RESET_ON;
  }
  else if (B1 != 0)
  {
    bleAppContext.B1_Switch = 1;
  }
     if ((B2 != 1)&&(bleAppContext.B2_Switch == 1))
  {
    UTIL_SEQ_SetTask(1U << CFG_TASK_BUTTON_2, CFG_SEQ_PRIO_0);
    bleAppContext.B2_Switch = 0;
    PWR_CO_GPIO_Status = PWR_CO_GPIO_TIM_RESET_ON;
  }
  else if (B2 != 0)
  {
    bleAppContext.B2_Switch = 1;
  }

  if ((B3 != 1)&&(bleAppContext.B3_Switch == 1))
  {
    UTIL_SEQ_SetTask(1U << CFG_TASK_BUTTON_3, CFG_SEQ_PRIO_0);
    bleAppContext.B3_Switch = 0;
    PWR_CO_GPIO_Status = PWR_CO_GPIO_TIM_RESET_ON;
  }
  else if (B3 != 0)
  {
    bleAppContext.B3_Switch = 1;
  }

  if (PWR_CO_GPIO_Status == PWR_CO_GPIO_TIM_RESET_ON)
  {
    UTIL_TIMER_Stop(&bleAppContext.DISABLE_IOs);
    UTIL_TIMER_StartWithPeriod(&bleAppContext.DISABLE_IOs, Setup_Time);
    PWR_CO_GPIO_Status = PWR_CO_GPIO_ON;
  }
  }
}

void Disable_GPIOs(void)
{
#if(CFG_LPM_LEVEL > 1)
  /*Put all GPIOs on analog*/
  GPIO_InitTypeDef GPIO_InitStruct = {0};

  __HAL_RCC_GPIOA_CLK_ENABLE();
  __HAL_RCC_GPIOB_CLK_ENABLE();
  __HAL_RCC_GPIOC_CLK_ENABLE();
  __HAL_RCC_GPIOH_CLK_ENABLE();

  GPIO_InitStruct.Mode = GPIO_MODE_ANALOG;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Pin  = GPIO_PIN_All;

  HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);
  HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);
  HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);
  HAL_GPIO_Init(GPIOH, &GPIO_InitStruct);

  __HAL_RCC_GPIOA_CLK_DISABLE();
  __HAL_RCC_GPIOB_CLK_DISABLE();
  __HAL_RCC_GPIOC_CLK_DISABLE();
  __HAL_RCC_GPIOH_CLK_DISABLE();

  PWR_CO_GPIO_Status = PWR_CO_GPIO_OFF;
#endif
  return;
}

static void GPIO_Off_Req(void *arg)
{
  UTIL_SEQ_SetTask(1 << CFG_TASK_GPIO_OFF_ID, CFG_SEQ_PRIO_0);
  return;
}

/* USER CODE END FD_WRAP_FUNCTIONS */
